In [2]:
import pandas as pd
import matplotlib.pyplot as plt

# Optional: Display plots inside notebook
%matplotlib inline

In [9]:
# Load the raw EV sales data
sales_df = pd.read_csv('final_ev_sales.csv')

# Show the first few rows
sales_df.head()

         Date     BYD  Tesla    NIO             Notes
0  2024-01-01  201493  71447  10055               NaN
1  2024-02-01  122311  60365   8132  Chinese New Year
2  2024-03-01  302459  89064  11866               NaN
3  2024-04-01  313245  62167  15620               NaN
4  2024-05-01  331817  61662  20544               NaN

In [14]:
#Fix the Date Format
#For sorting and plot time series charts later
sales_df = pd.read_csv('final_ev_sales.csv', header=0)
sales_df.head()
sales_df.rename(columns={'Date': 'Month'}, inplace=True)
sales_df['Month'] = pd.to_datetime(sales_df['Month'], format='mixed')

In [15]:
sales_df.head()

       Month     BYD  Tesla    NIO             Notes
0 2024-01-01  201493  71447  10055               NaN
1 2024-02-01  122311  60365   8132  Chinese New Year
2 2024-03-01  302459  89064  11866               NaN
3 2024-04-01  313245  62167  15620               NaN
4 2024-05-01  331817  61662  20544               NaN

In [16]:
sales_df.rename(columns={
    'Month': 'Date',
    'BYD_Sales': 'BYD',
    'Tesla_Sales': 'Tesla',
    'Wuling_Sales': 'Wuling'
}, inplace=True)

In [17]:
print(sales_df.info())
print(sales_df.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    17 non-null     datetime64[ns]
 1   BYD     17 non-null     int64
 2   Tesla   17 non-null     int64
 3   NIO     17 non-null     int64
 4   Notes   2 non-null      object
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 812.0+ bytes
None
Date      0
BYD       0
Tesla     0
NIO       0
Notes    15
dtype: int64

In [19]:
#Save cleaned file
sales_df.to_csv('final_ev_sales.csv', index=False)